{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "5d9ad914",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Requirement already satisfied: pypdf in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (4.3.0)\n",
      "Requirement already satisfied: langchain_community in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (0.2.7)\n",
      "Requirement already satisfied: langchain in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (0.2.8)\n",
      "Requirement already satisfied: langchain_openai in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (0.1.16)\n",
      "Requirement already satisfied: neo4j_genai in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (0.3.1)\n",
      "Requirement already satisfied: langchain_experimental in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (0.0.62)\n",
      "Requirement already satisfied: IPython in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (8.18.1)\n",
      "Requirement already satisfied: neo4j in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (5.22.0)\n",
      "Requirement already satisfied: yfiles_jupyter_graphs in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (1.7.2)\n",
      "Requirement already satisfied: yfiles_jupyter_graphs_for_neo4j==1.3.1 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (1.3.1)\n",
      "Requirement already satisfied: typing_extensions>=4.0 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from pypdf) (4.12.2)\n",
      "Requirement already satisfied: PyYAML>=5.3 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from langchain_community) (6.0.1)\n",
      "Requirement already satisfied: SQLAlchemy<3,>=1.4 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from langchain_community) (2.0.31)\n",
      "Requirement already satisfied: aiohttp<4.0.0,>=3.8.3 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from langchain_community) (3.9.5)\n",
      "Requirement already satisfied: dataclasses-json<0.7,>=0.5.7 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from langchain_community) (0.6.7)\n",
      "Requirement already satisfied: langchain-core<0.3.0,>=0.2.12 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from langchain_community) (0.2.20)\n",
      "Requirement already satisfied: langsmith<0.2.0,>=0.1.0 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from langchain_community) (0.1.88)\n",
      "Requirement already satisfied: numpy<2,>=1 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from langchain_community) (1.24.3)\n",
      "Requirement already satisfied: requests<3,>=2 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from langchain_community) (2.31.0)\n",
      "Requirement already satisfied: tenacity!=8.4.0,<9.0.0,>=8.1.0 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from langchain_community) (8.5.0)\n",
      "Requirement already satisfied: async-timeout<5.0.0,>=4.0.0 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from langchain) (4.0.3)\n",
      "Requirement already satisfied: langchain-text-splitters<0.3.0,>=0.2.0 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from langchain) (0.2.2)\n",
      "Requirement already satisfied: pydantic<3,>=1 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from langchain) (2.8.2)\n",
      "Collecting openai<2.0.0,>=1.32.0 (from langchain_openai)\n",
      "  Using cached openai-1.40.6-py3-none-any.whl.metadata (22 kB)\n",
      "Requirement already satisfied: tiktoken<1,>=0.7 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from langchain_openai) (0.7.0)\n",
      "Requirement already satisfied: eval-type-backport<0.3.0,>=0.2.0 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from neo4j_genai) (0.2.0)\n",
      "Requirement already satisfied: types-mock<6.0.0.0,>=5.1.0.20240425 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from neo4j_genai) (5.1.0.20240425)\n",
      "Requirement already satisfied: types-requests<3.0.0.0,>=2.31.0.20240218 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from neo4j_genai) (2.32.0.20240712)\n",
      "Requirement already satisfied: decorator in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from IPython) (5.1.1)\n",
      "Requirement already satisfied: jedi>=0.16 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from IPython) (0.19.1)\n",
      "Requirement already satisfied: matplotlib-inline in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from IPython) (0.1.7)\n",
      "Requirement already satisfied: prompt-toolkit<3.1.0,>=3.0.41 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from IPython) (3.0.47)\n",
      "Requirement already satisfied: pygments>=2.4.0 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from IPython) (2.18.0)\n",
      "Requirement already satisfied: stack-data in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from IPython) (0.6.3)\n",
      "Requirement already satisfied: traitlets>=5 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from IPython) (5.14.3)\n",
      "Requirement already satisfied: exceptiongroup in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from IPython) (1.2.0)\n",
      "Requirement already satisfied: pexpect>4.3 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from IPython) (4.9.0)\n",
      "Requirement already satisfied: pytz in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from neo4j) (2023.3)\n",
      "Requirement already satisfied: ipywidgets>=8.0.0 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from yfiles_jupyter_graphs) (8.1.3)\n",
      "Requirement already satisfied: aiosignal>=1.1.2 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain_community) (1.3.1)\n",
      "Requirement already satisfied: attrs>=17.3.0 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain_community) (23.2.0)\n",
      "Requirement already satisfied: frozenlist>=1.1.1 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain_community) (1.4.1)\n",
      "Requirement already satisfied: multidict<7.0,>=4.5 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain_community) (6.0.5)\n",
      "Requirement already satisfied: yarl<2.0,>=1.0 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from aiohttp<4.0.0,>=3.8.3->langchain_community) (1.9.4)\n",
      "Requirement already satisfied: marshmallow<4.0.0,>=3.18.0 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from dataclasses-json<0.7,>=0.5.7->langchain_community) (3.21.3)\n",
      "Requirement already satisfied: typing-inspect<1,>=0.4.0 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from dataclasses-json<0.7,>=0.5.7->langchain_community) (0.9.0)\n",
      "Requirement already satisfied: comm>=0.1.3 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from ipywidgets>=8.0.0->yfiles_jupyter_graphs) (0.2.2)\n",
      "Requirement already satisfied: widgetsnbextension~=4.0.11 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from ipywidgets>=8.0.0->yfiles_jupyter_graphs) (4.0.11)\n",
      "Requirement already satisfied: jupyterlab-widgets~=3.0.11 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from ipywidgets>=8.0.0->yfiles_jupyter_graphs) (3.0.11)\n",
      "Requirement already satisfied: parso<0.9.0,>=0.8.3 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from jedi>=0.16->IPython) (0.8.4)\n",
      "Requirement already satisfied: jsonpatch<2.0,>=1.33 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from langchain-core<0.3.0,>=0.2.12->langchain_community) (1.33)\n",
      "Requirement already satisfied: packaging<25,>=23.2 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from langchain-core<0.3.0,>=0.2.12->langchain_community) (24.1)\n",
      "Requirement already satisfied: orjson<4.0.0,>=3.9.14 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from langsmith<0.2.0,>=0.1.0->langchain_community) (3.10.6)\n",
      "Requirement already satisfied: anyio<5,>=3.5.0 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from openai<2.0.0,>=1.32.0->langchain_openai) (4.2.0)\n",
      "Requirement already satisfied: distro<2,>=1.7.0 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from openai<2.0.0,>=1.32.0->langchain_openai) (1.9.0)\n",
      "Requirement already satisfied: httpx<1,>=0.23.0 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from openai<2.0.0,>=1.32.0->langchain_openai) (0.27.0)\n",
      "Requirement already satisfied: jiter<1,>=0.4.0 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from openai<2.0.0,>=1.32.0->langchain_openai) (0.5.0)\n",
      "Requirement already satisfied: sniffio in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from openai<2.0.0,>=1.32.0->langchain_openai) (1.3.0)\n",
      "Requirement already satisfied: tqdm>4 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from openai<2.0.0,>=1.32.0->langchain_openai) (4.66.4)\n",
      "Requirement already satisfied: ptyprocess>=0.5 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from pexpect>4.3->IPython) (0.7.0)\n",
      "Requirement already satisfied: wcwidth in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from prompt-toolkit<3.1.0,>=3.0.41->IPython) (0.2.13)\n",
      "Requirement already satisfied: annotated-types>=0.4.0 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from pydantic<3,>=1->langchain) (0.6.0)\n",
      "Requirement already satisfied: pydantic-core==2.20.1 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from pydantic<3,>=1->langchain) (2.20.1)\n",
      "Requirement already satisfied: charset-normalizer<4,>=2 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from requests<3,>=2->langchain_community) (3.1.0)\n",
      "Requirement already satisfied: idna<4,>=2.5 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from requests<3,>=2->langchain_community) (3.4)\n",
      "Requirement already satisfied: urllib3<3,>=1.21.1 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from requests<3,>=2->langchain_community) (2.0.3)\n",
      "Requirement already satisfied: certifi>=2017.4.17 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from requests<3,>=2->langchain_community) (2023.5.7)\n",
      "Requirement already satisfied: regex>=2022.1.18 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from tiktoken<1,>=0.7->langchain_openai) (2024.5.15)\n",
      "Requirement already satisfied: executing>=1.2.0 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from stack-data->IPython) (2.0.1)\n",
      "Requirement already satisfied: asttokens>=2.1.0 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from stack-data->IPython) (2.4.1)\n",
      "Requirement already satisfied: pure-eval in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from stack-data->IPython) (0.2.2)\n",
      "Requirement already satisfied: six>=1.12.0 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from asttokens>=2.1.0->stack-data->IPython) (1.16.0)\n",
      "Requirement already satisfied: httpcore==1.* in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from httpx<1,>=0.23.0->openai<2.0.0,>=1.32.0->langchain_openai) (1.0.5)\n",
      "Requirement already satisfied: h11<0.15,>=0.13 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from httpcore==1.*->httpx<1,>=0.23.0->openai<2.0.0,>=1.32.0->langchain_openai) (0.14.0)\n",
      "Requirement already satisfied: jsonpointer>=1.9 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from jsonpatch<2.0,>=1.33->langchain-core<0.3.0,>=0.2.12->langchain_community) (3.0.0)\n",
      "Requirement already satisfied: mypy-extensions>=0.3.0 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from typing-inspect<1,>=0.4.0->dataclasses-json<0.7,>=0.5.7->langchain_community) (1.0.0)\n",
      "Using cached openai-1.40.6-py3-none-any.whl (361 kB)\n",
      "Installing collected packages: openai\n",
      "  Attempting uninstall: openai\n",
      "    Found existing installation: openai 0.28.0\n",
      "    Uninstalling openai-0.28.0:\n",
      "      Successfully uninstalled openai-0.28.0\n",
      "Successfully installed openai-1.40.6\n",
      "\n",
      "\u001b[1m[\u001b[0m\u001b[34;49mnotice\u001b[0m\u001b[1;39;49m]\u001b[0m\u001b[39;49m A new release of pip is available: \u001b[0m\u001b[31;49m24.1.2\u001b[0m\u001b[39;49m -> \u001b[0m\u001b[32;49m24.2\u001b[0m\n",
      "\u001b[1m[\u001b[0m\u001b[34;49mnotice\u001b[0m\u001b[1;39;49m]\u001b[0m\u001b[39;49m To update, run: \u001b[0m\u001b[32;49mpip install --upgrade pip\u001b[0m\n",
      "Note: you may need to restart the kernel to use updated packages.\n"
     ]
    }
   ],
   "source": [
    "# Install required packages using pip\n",
    "%pip install pypdf langchain_community langchain langchain_openai neo4j_genai langchain_experimental IPython neo4j yfiles_jupyter_graphs yfiles_jupyter_graphs_for_neo4j==1.3.1"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5cdf86a7",
   "metadata": {},
   "source": [
    "## Initialization\n",
    "This section initializes the notebook by importing necessary libraries and loading environment variables."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "82c6085d",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Import necessary libraries\n",
    "import pandas as pd\n",
    "import numpy as np\n",
    "from langchain_community.document_loaders import PyPDFLoader\n",
    "from langchain.text_splitter import RecursiveCharacterTextSplitter\n",
    "from langchain_openai import OpenAIEmbeddings\n",
    "import os\n",
    "from dotenv import load_dotenv\n",
    "from neo4j import GraphDatabase\n",
    "import ast\n",
    "\n",
    "# Check if running in Google Colab and enable custom widget manager if true\n",
    "try:\n",
    "  import google.colab\n",
    "  from google.colab import output\n",
    "  output.enable_custom_widget_manager()\n",
    "except:\n",
    "  pass"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "id": "5269f226",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Load environment variables from 'credentials.env' if it exists\n",
    "if os.path.exists('credentials.env'):\n",
    "    load_dotenv('credentials.env', override=True)\n",
    "\n",
    "    # Neo4j credentials\n",
    "    uri = os.getenv('NEO4J_URI')\n",
    "    username = os.getenv('NEO4J_USERNAME')\n",
    "    password = os.getenv('NEO4J_PASSWORD')\n",
    "    database = os.getenv('NEO4J_DATABASE')\n",
    "\n",
    "    # OpenAI credentials\n",
    "    OPENAI_API_KEY = os.getenv('OPENAI_API_KEY')\n",
    "    os.environ['OPENAI_API_KEY']=OPENAI_API_KEY\n",
    "else:\n",
    "    print(\"File 'credentials.env' not found.\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "ee901e91",
   "metadata": {},
   "source": [
    "## Create Chunk Nodes and Embeddings\n",
    "Load the predefined chunks from the JSON file into the graph."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "id": "df539ea0",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Initialize text splitter with specified chunk size and overlap\n",
    "chunk_size = 800\n",
    "chunk_overlap = 100\n",
    "text_splitter = RecursiveCharacterTextSplitter(\n",
    "    chunk_size = chunk_size,\n",
    "    chunk_overlap  = chunk_overlap,\n",
    "    length_function = len,\n",
    "    is_separator_regex = False,\n",
    ")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "id": "746d3287",
   "metadata": {},
   "outputs": [],
   "source": [
    "import json\n",
    "\n",
    "# Define the path to the JSON file\n",
    "file_path = 'data_autobahn/D83.json'\n",
    "\n",
    "# Open and load the JSON file\n",
    "with open(file_path, 'r', encoding='utf-8') as file:\n",
    "    all_chunks = json.load(file)\n",
    "    all_chunks = [{'group':chunk['Group'], 'text':chunk[\"Concatenated Text\"], 'unit':chunk['unit'], 'amount':chunk['amount']} for chunk in all_chunks]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "8ba8dd98",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "\n",
      "First chunk: \n",
      "Sämtliche Verkehrsführungspläne einschließlich der kompletten Beschilderung (jeweils 22-fach in Papierform) erstellen. Grundlagen bilden die Baubeschreibung, das Verkehrsführungskonzept des AG, die Regelpläne der RSA und die ZTV-SA. Für jede der Bauphasen ist jeweils ein gesonderter Verkehrsführungsplan zu erstellen. Für die Verkehrsanordnung vor Baubeginn ist folgendes zu beachten: Die gesamten Unterlagen sind spätestens sechs Werktage nach Auftragserteilung zur Genehmigung vorzulegen. Gilt für BA 2.\n",
      "\n",
      "Second chunk: \n",
      "Sämtliche Verkehrsführungspläne einschließlich der kompletten Beschilderung (jeweils 22-fach in Papierform) erstellen. Grundlagen bilden die Baubeschreibung, das Verkehrsführungskonzept des AG, die Regelpläne der RSA und die ZTV-SA. Für jede der Bauphasen ist jeweils ein gesonderter Verkehrsführungsplan zu erstellen. Für die Verkehrsanordnung vor Baubeginn ist folgendes zu beachten: Die gesamten Unterlagen sind spätestens sechs Werktage nach Auftragserteilung zur Genehmigung vorzulegen. Gilt für BA 3.\n"
     ]
    }
   ],
   "source": [
    "all_chunks = all_chunks[0:10]\n",
    "# Check the first two chunks to ensure correct splitting\n",
    "print('\\nFirst chunk: \\n' + all_chunks[0]['text'])\n",
    "print('\\nSecond chunk: \\n' + all_chunks[1]['text'])"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "f4a83101",
   "metadata": {},
   "outputs": [],
   "source": [
    "# Generate embeddings for each chunk using OpenAI model\n",
    "model = 'text-embedding-3-small'\n",
    "embeddings_model = OpenAIEmbeddings(\n",
    "    model = model,\n",
    "    openai_api_key = OPENAI_API_KEY\n",
    ")\n",
    "embeddings = []\n",
    "for chunk in all_chunks:\n",
    "    embeddings.append(embeddings_model.embed_query(chunk['text']))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "id": "c4f51b3b",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "{'group': '00000001', 'text': 'Sämtliche Verkehrsführungspläne einschließlich der kompletten Beschilderung (jeweils 22-fach in Papierform) erstellen. Grundlagen bilden die Baubeschreibung, das Verkehrsführungskonzept des AG, die Regelpläne der RSA und die ZTV-SA. Für jede der Bauphasen ist jeweils ein gesonderter Verkehrsführungsplan zu erstellen. Für die Verkehrsanordnung vor Baubeginn ist folgendes zu beachten: Die gesamten Unterlagen sind spätestens sechs Werktage nach Auftragserteilung zur Genehmigung vorzulegen. Gilt für BA 2.', 'unit': 'Psch', 'amount': '00000001000'}\n",
      "\n",
      "First embedding (sample): \n",
      "[0.020278731361031532, 0.04067584127187729, -0.07306499034166336, -0.02708566002547741, -0.006173589266836643, 0.009002904407680035, -0.04088892787694931, -0.027061983942985535, 0.010358370840549469, 0.015768399462103844, -0.05355573818087578, 0.06013774126768112, -0.004317960701882839, 0.010908843949437141, -0.061132144182920456, -0.011518508195877075, 0.023510541766881943, -0.014560909941792488, -0.02945328876376152, 0.05402926355600357, -0.007600084878504276, -0.02251613885164261, -0.02109556272625923, -0.04114937037229538, -0.05724923685193062, 0.04981488734483719, 0.0065109762363135815, -0.000904877670109272, -0.04564785957336426, 0.02242143452167511, -0.013495477847754955, 0.0014427731512114406, -0.015555313788354397, 0.003456736449152231, 0.022587167099118233, -0.020894313231110573, -0.01433598529547453, 0.003992412239313126, 0.026872573420405388, 0.025049500167369843, 0.00208351225592196, 0.033833399415016174, -0.021557249128818512, 0.023877525702118874, 0.022918635979294777, -0.014407014474272728, 0.036343082785606384, -0.03771630674600601, 0.03196297213435173, 0.03411751613020897, 0.002036159858107567, 0.023096207529306412, 0.002685777610167861, 0.02032608352601528, 0.019947262480854988, -0.027014631778001785, -0.00497497757896781, -0.01991174928843975, 0.0522298663854599, 0.0011793745215982199, 0.0010669121984392405, -0.02725139446556568, 0.022646358236670494, 3.588435720303096e-05, -0.017058758065104485, 0.00032924822880886495, 0.033478256314992905, 0.031939297914505005, 0.010251827538013458, 0.026351695880293846, 0.030873864889144897, 0.03518294543027878, -0.055071018636226654, -0.005827323533594608, -0.009606649167835712, -0.01134093664586544, 0.03319413959980011, 0.0019148188875988126, 0.03246017545461655, -0.037219107151031494, -0.041267748922109604, -0.0004565082199405879, -0.01606435328722, -0.0921480655670166, -0.08045198768377304, 0.0444403700530529, -0.0035336841829121113, -0.024812737479805946, -0.02800903469324112, 0.0005896872607991099, 0.04536374658346176, -0.028648294508457184, 0.02540464513003826, 0.008399158716201782, 0.02355789579451084, -0.015425094403326511, 0.02103637158870697, 0.0022803214378654957, -0.004323880188167095]\n"
     ]
    }
   ],
   "source": [
    "# Check the first embedding to ensure correct generation\n",
    "print(all_chunks[0])\n",
    "print('\\nFirst embedding (sample): \\n' + str(embeddings[0][1:100]))"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "59d1ce2d",
   "metadata": {},
   "source": [
    "## Write Data to Neo4j\n",
    "This section shows how to clear the existing database, create document nodes, and link text chunks with their embeddings in Neo4j."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 9,
   "id": "1358cb39",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Database cleared.\n"
     ]
    }
   ],
   "source": [
    "# Connect to Neo4j and clear the database\n",
    "driver = GraphDatabase.driver(uri, auth=(username, password), database=database)\n",
    "driver.execute_query('MATCH (n) DETACH DELETE n')\n",
    "print(\"Database cleared.\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 10,
   "id": "6459f30c-c015-49c9-9fab-701e57ca58cd",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Vector index created\n"
     ]
    }
   ],
   "source": [
    "driver.execute_query(\"\"\"\n",
    "CREATE VECTOR INDEX vecindex IF NOT EXISTS\n",
    "FOR (m:Chunk)\n",
    "ON m.embedding\n",
    "OPTIONS {indexConfig: {\n",
    " `vector.dimensions`: 1536,\n",
    " `vector.similarity_function`: 'cosine'\n",
    "}}\"\"\")\n",
    "print(\"Vector index created\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 11,
   "id": "2bb0ee53-933a-44ec-87aa-5af1724b5454",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Indexes created.\n"
     ]
    }
   ],
   "source": [
    "driver.execute_query(\"\"\"CREATE INDEX IF NOT EXISTS FOR (n:Chunk) ON (n.index) \"\"\")\n",
    "driver.execute_query(\"\"\"CREATE INDEX IF NOT EXISTS FOR (n:Unit) ON (n.name) \"\"\")\n",
    "driver.execute_query(\"\"\"CREATE INDEX IF NOT EXISTS FOR (n:Amount) ON (n.value) \"\"\")\n",
    "print(\"Indexes created.\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 12,
   "id": "25d2b5f1",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Document created.\n"
     ]
    }
   ],
   "source": [
    "# Create a document node for the PDF\n",
    "driver.execute_query('CREATE (d:Document{name:\"'+file_path+'\"})')\n",
    "print('Document created.')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 13,
   "id": "29cf8eb3-1dfb-4993-97e8-6e4e039c94f1",
   "metadata": {},
   "outputs": [],
   "source": [
    "\n",
    "for index, chunk in enumerate(all_chunks):\n",
    "    driver.execute_query(\"\"\"\n",
    "    MERGE (:Unit{name:$unit})\n",
    "    \"\"\", {'unit': chunk['unit']})\n",
    "\n",
    "for index, chunk in enumerate(all_chunks):\n",
    "    driver.execute_query(\"\"\"\n",
    "    MERGE (:Amount{value:toFloat($amount)/1000.0})\n",
    "    \"\"\", {'amount': chunk['amount']})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "a7e0514b-d267-4aa3-a0ab-05c0ecbb7f60",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 14,
   "id": "3235a7ee-ef2d-4a1c-9732-454c6620cdf2",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Chunks created and embeddings set.\n"
     ]
    }
   ],
   "source": [
    "# Create chunk nodes and link them to the document node\n",
    "for index, chunk in enumerate(all_chunks):\n",
    "    embedding = embeddings[index]\n",
    "    driver.execute_query(f\"\"\"\n",
    "    MATCH (d:Document)\n",
    "    WHERE d.name = '{file_path}'\n",
    "    CREATE (d)-[:HAS_CHUNK]->(c:Chunk)\n",
    "    SET c.text = $text\n",
    "    SET c.group = '{all_chunks[index]['group']}'\n",
    "    SET c.embedding = {embedding}\n",
    "    SET c.index = {index}\n",
    "    \"\"\", {'text': chunk['text']})\n",
    "    \n",
    "print('Chunks created and embeddings set.')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "id": "0f9a7c54-d385-4b23-8ced-d39f47db1342",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Chunks linked to amounts and units\n"
     ]
    }
   ],
   "source": [
    "# Create chunk nodes and link them to the document node\n",
    "for index, chunk in enumerate(all_chunks):\n",
    "    embedding = embeddings[index]\n",
    "    driver.execute_query(f\"\"\"\n",
    "    MATCH (c:Chunk), (a:Amount), (u:Unit)\n",
    "    WHERE c.index = $index AND a.value = toFloat($amount)/1000.0 AND u.name = $unit\n",
    "    CREATE (c)-[:HAS_AMOUNT]->(a)\n",
    "    CREATE (c)-[:HAS_UNIT]->(u)\n",
    "    \"\"\", {'index': index, 'amount': chunk['amount'], 'unit': chunk['unit']})\n",
    "    \n",
    "print('Chunks linked to amounts and units')"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "5ff8cf07",
   "metadata": {},
   "source": [
    "## Visualize the Graph\n",
    "Use yFiles Jupyter graphs for Neo4j to visualize the document and its chunks."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "id": "a1d8bfd1",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "c7d6e2071ba0477e87a480572d3b3818",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "GraphWidget(layout=Layout(height='680px', width='100%'))"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# Visualize the document and chunks in Neo4j\n",
    "from yfiles_jupyter_graphs_for_neo4j import Neo4jGraphWidget\n",
    "widget = Neo4jGraphWidget(driver, overview_enabled=False, context_start_with=None)\n",
    "widget.add_node_configuration('Chunk', text= lambda node : {\n",
    "        'text': node['properties']['text'], \n",
    "        'fontSize': 20, \n",
    "        'maximumWidth': 500, \n",
    "        'wrapping': 'word', \n",
    "        'textAlignment': 'center'\n",
    "    })  \n",
    "widget.show_cypher(\"MATCH path=(d:Document)-[r]->(c:Chunk)-[]->() RETURN path LIMIT 20\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "6763a0dc-809d-4c1b-8bbe-5506ab8bbf96",
   "metadata": {},
   "source": [
    "## Extract Graph from Text\n",
    "First, clear all the entities if we had run the workflow before."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "id": "270912f1-188c-475e-93bd-9439ea657716",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Cleared all extracted entities.\n"
     ]
    }
   ],
   "source": [
    "# Connect to Neo4j and clear the database\n",
    "driver = GraphDatabase.driver(uri, auth=(username, password), database=database)\n",
    "# Connect to Neo4j and clear the database\n",
    "driver.execute_query(\"\"\"MATCH ()-[r]->() \n",
    "WHERE NOT type(r) IN [\"HAS_UNIT\",\"HAS_AMOUNT\",\"HAS_CHUNK\"]\n",
    "DELETE r\"\"\")\n",
    "\n",
    "driver.execute_query(\"\"\"MATCH (n)\n",
    "WHERE NOT labels(n)[0] IN [\"Chunk\", \"Document\", \"Amount\", \"Unit\"]\n",
    "DELETE n\"\"\")\n",
    "print(\"Cleared all extracted entities.\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "81f5e8f9-e0d6-4434-b34b-e1e5b8035691",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "markdown",
   "id": "98353631-95d3-4cbb-ba22-7d102a53e70a",
   "metadata": {},
   "source": [
    "## Define prompting for entity extraction.\n",
    "We customize the LangChain method code to allow for an annotated schema.\n",
    "The idea is to merge these two approaches together:\n",
    "\n",
    "https://api.python.langchain.com/en/latest/_modules/langchain_experimental/graph_transformers/llm.html#LLMGraphTransformer\n",
    "\n",
    "https://github.com/neo4j-partners/neo4j-generative-ai-azure/blob/main/ingestion/ingestion.ipynb\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "id": "5f4ee87b-b4ff-4fb8-8528-386c73486edb",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Collecting openai==0.28\n",
      "  Using cached openai-0.28.0-py3-none-any.whl.metadata (13 kB)\n",
      "Requirement already satisfied: requests>=2.20 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from openai==0.28) (2.31.0)\n",
      "Requirement already satisfied: tqdm in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from openai==0.28) (4.66.4)\n",
      "Requirement already satisfied: aiohttp in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from openai==0.28) (3.9.5)\n",
      "Requirement already satisfied: charset-normalizer<4,>=2 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from requests>=2.20->openai==0.28) (3.1.0)\n",
      "Requirement already satisfied: idna<4,>=2.5 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from requests>=2.20->openai==0.28) (3.4)\n",
      "Requirement already satisfied: urllib3<3,>=1.21.1 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from requests>=2.20->openai==0.28) (2.0.3)\n",
      "Requirement already satisfied: certifi>=2017.4.17 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from requests>=2.20->openai==0.28) (2023.5.7)\n",
      "Requirement already satisfied: aiosignal>=1.1.2 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from aiohttp->openai==0.28) (1.3.1)\n",
      "Requirement already satisfied: attrs>=17.3.0 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from aiohttp->openai==0.28) (23.2.0)\n",
      "Requirement already satisfied: frozenlist>=1.1.1 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from aiohttp->openai==0.28) (1.4.1)\n",
      "Requirement already satisfied: multidict<7.0,>=4.5 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from aiohttp->openai==0.28) (6.0.5)\n",
      "Requirement already satisfied: yarl<2.0,>=1.0 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from aiohttp->openai==0.28) (1.9.4)\n",
      "Requirement already satisfied: async-timeout<5.0,>=4.0 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from aiohttp->openai==0.28) (4.0.3)\n",
      "Using cached openai-0.28.0-py3-none-any.whl (76 kB)\n",
      "Installing collected packages: openai\n",
      "  Attempting uninstall: openai\n",
      "    Found existing installation: openai 1.40.6\n",
      "    Uninstalling openai-1.40.6:\n",
      "      Successfully uninstalled openai-1.40.6\n",
      "\u001b[31mERROR: pip's dependency resolver does not currently take into account all the packages that are installed. This behaviour is the source of the following dependency conflicts.\n",
      "langchain-openai 0.1.16 requires openai<2.0.0,>=1.32.0, but you have openai 0.28.0 which is incompatible.\u001b[0m\u001b[31m\n",
      "\u001b[0mSuccessfully installed openai-0.28.0\n",
      "\n",
      "\u001b[1m[\u001b[0m\u001b[34;49mnotice\u001b[0m\u001b[1;39;49m]\u001b[0m\u001b[39;49m A new release of pip is available: \u001b[0m\u001b[31;49m24.1.2\u001b[0m\u001b[39;49m -> \u001b[0m\u001b[32;49m24.2\u001b[0m\n",
      "\u001b[1m[\u001b[0m\u001b[34;49mnotice\u001b[0m\u001b[1;39;49m]\u001b[0m\u001b[39;49m To update, run: \u001b[0m\u001b[32;49mpip install --upgrade pip\u001b[0m\n",
      "Note: you may need to restart the kernel to use updated packages.\n",
      "Requirement already satisfied: python-dotenv in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (1.0.1)\n",
      "\n",
      "\u001b[1m[\u001b[0m\u001b[34;49mnotice\u001b[0m\u001b[1;39;49m]\u001b[0m\u001b[39;49m A new release of pip is available: \u001b[0m\u001b[31;49m24.1.2\u001b[0m\u001b[39;49m -> \u001b[0m\u001b[32;49m24.2\u001b[0m\n",
      "\u001b[1m[\u001b[0m\u001b[34;49mnotice\u001b[0m\u001b[1;39;49m]\u001b[0m\u001b[39;49m To update, run: \u001b[0m\u001b[32;49mpip install --upgrade pip\u001b[0m\n",
      "Note: you may need to restart the kernel to use updated packages.\n",
      "Requirement already satisfied: retry in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (0.9.2)\n",
      "Requirement already satisfied: decorator>=3.4.2 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from retry) (5.1.1)\n",
      "Requirement already satisfied: py<2.0.0,>=1.4.26 in /Users/nielsdejong/.pyenv/versions/3.9.15/lib/python3.9/site-packages (from retry) (1.11.0)\n",
      "\n",
      "\u001b[1m[\u001b[0m\u001b[34;49mnotice\u001b[0m\u001b[1;39;49m]\u001b[0m\u001b[39;49m A new release of pip is available: \u001b[0m\u001b[31;49m24.1.2\u001b[0m\u001b[39;49m -> \u001b[0m\u001b[32;49m24.2\u001b[0m\n",
      "\u001b[1m[\u001b[0m\u001b[34;49mnotice\u001b[0m\u001b[1;39;49m]\u001b[0m\u001b[39;49m To update, run: \u001b[0m\u001b[32;49mpip install --upgrade pip\u001b[0m\n",
      "Note: you may need to restart the kernel to use updated packages.\n"
     ]
    }
   ],
   "source": [
    "%pip install openai==0.28\n",
    "%pip install python-dotenv \n",
    "%pip install retry"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 19,
   "id": "ab6cd0ce-8c33-4f07-b8c8-47133b0e3d25",
   "metadata": {},
   "outputs": [],
   "source": [
    "from retry import retry\n",
    "import openai\n",
    "from openai import OpenAI\n",
    "\n",
    "client = OpenAI()\n",
    "\n",
    "\n",
    "# Helper function for calling LLM with custom prompt.\n",
    "@retry(tries=2, delay=5)\n",
    "def call_llm(system, prompt):\n",
    "    completion = client.chat.completions.create(\n",
    "          model=\"gpt-4o\",\n",
    "          temperature=0,  # Try to be as deterministic as possible\n",
    "          messages=[\n",
    "            {\"role\": \"system\", \"content\": system},\n",
    "            {\"role\": \"user\", \"content\": prompt}\n",
    "          ]\n",
    "        )\n",
    "    return completion.choices[0].message.content"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "id": "51c4e876-fbf2-44ec-8954-8a81f49315db",
   "metadata": {},
   "outputs": [],
   "source": [
    "system_prompt = (\n",
    "    \"# Knowledge Graph Instructions for GPT-4\\n\"\n",
    "    \"## 1. Overview\\n\"\n",
    "    \"You are a top-tier algorithm designed for extracting information in structured \"\n",
    "    \"formats to build a knowledge graph.\\n\"\n",
    "    \"Try to capture as much information from the text as possible without \"\n",
    "    \"sacrificing accuracy. Do not add any information that is not explicitly \"\n",
    "    \"mentioned in the text.\\n\"\n",
    "    \"- **Nodes** represent entities and concepts.\\n\"\n",
    "    \"- The aim is to achieve simplicity and clarity in the knowledge graph, making it\\n\"\n",
    "    \"accessible for a vast audience.\\n\"\n",
    "    \"## 2. Labeling Nodes\\n\"\n",
    "    \"- **Consistency**: Ensure you use available types for node labels.\\n\"\n",
    "    \"Ensure you use basic or elementary types for node labels.\\n\"\n",
    "    \"- For example, when you identify an entity representing a person, \"\n",
    "    \"always label it as **'person'**. Avoid using more specific terms \"\n",
    "    \"like 'mathematician' or 'scientist'.\"\n",
    "    \"- **Node IDs**: Never utilize integers as node IDs. Node IDs should be \"\n",
    "    \"names or human-readable identifiers found in the text.\\n\"\n",
    "    \"- **Relationships** represent connections between entities or concepts.\\n\"\n",
    "    \"Ensure consistency and generality in relationship types when constructing \"\n",
    "    \"knowledge graphs. Instead of using specific and momentary types \"\n",
    "    \"such as 'BECAME_PROFESSOR', use more general and timeless relationship types \"\n",
    "    \"like 'PROFESSOR'. Make sure to use general and timeless relationship types!\\n\"\n",
    "    \"## 3. Coreference Resolution\\n\"\n",
    "    \"- **Maintain Entity Consistency**: When extracting entities, it's vital to \"\n",
    "    \"ensure consistency.\\n\"\n",
    "    'If an entity, such as \"John Doe\", is mentioned multiple times in the text '\n",
    "    'but is referred to by different names or pronouns (e.g., \"Joe\", \"he\"),'\n",
    "    \"always use the most complete identifier for that entity throughout the \"\n",
    "    'knowledge graph. In this example, use \"John Doe\" as the entity ID.\\n'\n",
    "    \"Remember, the knowledge graph should be coherent and easily understandable, \"\n",
    "    \"so maintaining consistency in entity references is crucial.\\n\"\n",
    "    \"## 4. Strict Compliance\\n\"\n",
    "    \"Adhere to the rules strictly. Non-compliance will result in termination.\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 21,
   "id": "6bcefe4f-5b7d-433e-b23b-a39e97073948",
   "metadata": {},
   "outputs": [],
   "source": [
    "template_prompt=\"\"\"From the technical description of a construction task below, extract the following Entities & relationships. The text is in German. described in the mentioned format \n",
    "0. ALWAYS FINISH THE OUTPUT. Never send partial responses.\n",
    "1. First, look for these Entity types in the text and generate as comma-separated format similar to entity type.\n",
    "   `name` property of each entity must be alphanumeric and must be unique among the entities. You will be referring this property to define the relationship between entities. Do not create new entity types that aren't mentioned below. You will have to generate as many entities as needed as per the types below:\n",
    "    \n",
    "    Entity Types:\n",
    "    \n",
    "    label:'Unit',name:string // A unit of measurement, e.g. KG, M, Psc\n",
    "    label:'Amount',unit:str, value:float // A numeric value with a unit.\n",
    "    label:'Option',name:string // An option that is selected as part of the task.\n",
    "    label:'Material',name:string // A material that is used in the task. E.g. metal, concrete, powder.\n",
    "    label:'Norm',name:string // A norm or standard this is applied in this task.\n",
    "    label:'Dimension',name:string // A dimension relevant to the task.\n",
    "    label:'Relation',position_id:string // A relation to another task. For example, they may refer to the previous task. This should be embedded here.\n",
    "    \n",
    "2. Next, generate relationships between the entities. To refer the head (start) and tail (end) entity, use their respective `name` property. \n",
    "The relationship types can only be generated between pairs of node labels as specified here:\n",
    "    \n",
    "    Relationship Types:\n",
    "    from:'Norm',to:'Option',relationship_type:'HAS_OPTION'\n",
    "\n",
    "\n",
    "The output should look like this. IT MUST BE VALID JSON:\n",
    "{\n",
    "    \"entities\": [{\"label\":\"Option\",\"name\":\"Yellow Line\"}],\n",
    "    \"relationships\": [{\"start_label\":\"Option\", \"start_name\": \"Yellow Line\", \"relationship_type\":\"RELATED_TO\",\"end_label\":\"Option\", \"end_name\": \"Red Line\"}],\n",
    "}\n",
    "\n",
    "For the following text, extract entities and relations:\n",
    "$text\n",
    "\"\"\""
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 22,
   "id": "c17a4831-9cf2-47df-a76f-69ed695a09ff",
   "metadata": {
    "scrolled": true
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Loaded chunk 1/10\n",
      "Loaded chunk 2/10\n",
      "Loaded chunk 3/10\n",
      "Loaded chunk 4/10\n",
      "Loaded chunk 5/10\n",
      "Loaded chunk 6/10\n",
      "Loaded chunk 7/10\n",
      "Loaded chunk 8/10\n",
      "Loaded chunk 9/10\n",
      "Loaded chunk 10/10\n"
     ]
    }
   ],
   "source": [
    "from string import Template\n",
    "\n",
    "def run_completion(text):\n",
    "    try:\n",
    "      prompt = Template(template_prompt).substitute(text=text)\n",
    "      res = call_llm(system_prompt, prompt)\n",
    "      parsed = json.loads(res.replace('```json', '').replace('```','').replace(\"\\'\", \"'\"))\n",
    "      \n",
    "      return parsed\n",
    "    except Exception as e:\n",
    "        print(e)\n",
    "\n",
    "chunk_entities = []\n",
    "for index, chunk in enumerate(all_chunks):\n",
    "    chunk_entities.append(run_completion(chunk['text']))\n",
    "    print(f\"Loaded chunk {index+1}/{len(all_chunks)}\")\n",
    "    "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 24,
   "id": "d76e1070-c4fa-4ca0-8330-080f7248f421",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Nodes created and linked to chunks.\n"
     ]
    }
   ],
   "source": [
    "\n",
    "# Write nodes to Neo4j and link them to the corresponding chunks\n",
    "## TODO -> this needs some optimization using parameters / batching.\n",
    "for index, chunk_obj in enumerate(chunk_entities):\n",
    "    driver.execute_query(\"\"\"\n",
    "    UNWIND $entities as entity\n",
    "    CALL apoc.merge.node([entity.label],entity) YIELD node as n\n",
    "    WITH n\n",
    "    MATCH (c:Chunk)\n",
    "    WHERE c.index = $index\n",
    "    CREATE (n)-[:IN]->(c)\n",
    "    \"\"\", {'index': index, 'entities':chunk_obj['entities']})\n",
    "\n",
    "print('Nodes created and linked to chunks.')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 27,
   "id": "1e53465e-0b22-4e20-a699-a1ef4c1ce0ec",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Rels created and linked to nodes.\n"
     ]
    }
   ],
   "source": [
    "# Write relationships to Neo4j and link them to the corresponding nodes.\n",
    "## TODO -> this needs some optimization using parameters / batching.\n",
    "for index, chunk_obj in enumerate(chunk_entities):\n",
    "    driver.execute_query(\"\"\"\n",
    "    UNWIND $relationships as rel\n",
    "    CALL apoc.merge.node([rel.start_label],{name:rel.start_name}) YIELD node as n\n",
    "    WITH rel, n\n",
    "    CALL apoc.merge.node([rel.end_label],{name:rel.end_name}) YIELD node as n2\n",
    "    WITH rel, n, n2\n",
    "    CALL apoc.merge.relationship(n, rel.relationship_type, {}, {}, n2)\n",
    "    YIELD rel as created\n",
    "    RETURN created\n",
    "    \"\"\", {'index': index, 'relationships':chunk_obj['relationships']})\n",
    "\n",
    "print('Rels created and linked to nodes.')"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "id": "b69dcefa-e79b-4420-a84b-cdae1a1aa677",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "1efd44553f4442b8bec048d92ba21203",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "GraphWidget(layout=Layout(height='800px', width='100%'))"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# Visualize the graph in Neo4j\n",
    "from yfiles_jupyter_graphs_for_neo4j import Neo4jGraphWidget\n",
    "widget = Neo4jGraphWidget(driver, overview_enabled=False, context_start_with=None)\n",
    "widget.show_cypher(\"MATCH (d)-[r]->(c) WHERE NOT type(r) in ['HAS_CHUNK','HAS_UNIT','IN'] RETURN d,r,c LIMIT 2000\")"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "15bf31c0-b04a-46ee-bc8e-2a04d2c2f444",
   "metadata": {},
   "source": [
    "## Time for Querying\n",
    "We now demonstrate how to use both regular VectorRAG and GraphRAG to ask questions to the database:\n",
    "- The VectorRAG implementation uses only the chunked text and their embeddings.\n",
    "- The GraphRAG implementation also uses the context around the documents (extracted entities and their relationships) to generate an answer."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 30,
   "id": "f0b85abc-9bd4-4d06-94e8-14ec30c82b31",
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase\n",
    "from neo4j_genai.retrievers import VectorRetriever, VectorCypherRetriever\n",
    "from neo4j_genai.llm import OpenAILLM\n",
    "from neo4j_genai.generation import GraphRAG\n",
    "from neo4j_genai.embeddings.openai import OpenAIEmbeddings\n",
    "\n",
    "index_name = \"vecindex\"\n",
    "### Set up the RAG framework\n",
    "\n",
    "# 1. Connect to Neo4j database\n",
    "driver = GraphDatabase.driver(uri, auth=(username, password), database=database)\n",
    "\n",
    "# 2. Create Embedder object, needed to convert the user question (text) to a vector\n",
    "embedder = OpenAIEmbeddings(model=\"text-embedding-3-small\")\n",
    "\n",
    "# 3. LLM\n",
    "llm = OpenAILLM(model_name=\"gpt-4o\", model_params={\"temperature\": 0})"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 31,
   "id": "420d6601-a11c-42b6-8152-d49bb3a8006d",
   "metadata": {},
   "outputs": [],
   "source": [
    "query_text = \"how much Bitumenemulsion do we need to spray per m2, and what is the Bindemittel code\""
   ]
  },
  {
   "cell_type": "markdown",
   "id": "219f1c6b-1020-4ee1-848d-7fc61efed725",
   "metadata": {},
   "source": [
    "## VectorRAG\n",
    "Illustrating RAG without using the graph..."
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 32,
   "id": "f3aa80d9-304d-48d1-8a38-f4430f41a3e8",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Response with VectorRAG:\n",
      "The provided context does not contain information about the amount of Bitumenemulsion needed per m² or the Bindemittel code. Please provide additional details or context related to Bitumenemulsion and Bindemittel for a more accurate answer.\n"
     ]
    }
   ],
   "source": [
    "# Vector RAG:\n",
    "retriever = VectorRetriever(driver, index_name, embedder)\n",
    "# Initialize the RAG pipeline (note: this is just using plain vector RAG without context)\n",
    "rag = GraphRAG(retriever=retriever, llm=llm)\n",
    "\n",
    "response = rag.search(query_text, retriever_config={\"top_k\": 3})\n",
    "print(\"Response with VectorRAG:\")\n",
    "print(response.answer)"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "c6e1383e-1f72-4402-be19-aa8dc5412f4d",
   "metadata": {},
   "source": [
    "## GraphRAG\n",
    "Now using the context"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "id": "70a564ca-2839-4b35-9bc3-8afb8192169c",
   "metadata": {},
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "Response with GraphRAG:\n",
      "The context provided does not contain specific information about the amount of Bitumenemulsion needed to spray per m² or the Bindemittel code. You may need to refer to specific project guidelines, technical specifications, or consult with a professional in the field for accurate details.\n"
     ]
    }
   ],
   "source": [
    "# Now, context-aware GraphRAG\n",
    "retriever = VectorCypherRetriever(\n",
    "    driver,\n",
    "    index_name=index_name,\n",
    "    retrieval_query=\"\"\"\n",
    "    // Retrieve Neighbourhood (Context)\n",
    "    MATCH path=(node)<-[r:IN]-(node2)\n",
    "    OPTIONAL MATCH (node2)-[r2]-(node3) \n",
    "    WHERE type(r2) <> \"IN\"\n",
    "    RETURN \n",
    "        node.group as group,\n",
    "        node.index as chunkindex, \n",
    "        //node.text as chunktext,\n",
    "\n",
    "        labels(node2)[0] as sourcelabel,\n",
    "        node2.name as source, \n",
    "        \n",
    "        type(r2) as reltype, \n",
    "        \n",
    "        labels(node3)[0] as destlabel,\n",
    "        node3.name as dest, \n",
    "        \n",
    "        \n",
    "        score\"\"\",\n",
    "    embedder=embedder\n",
    ")\n",
    "\n",
    "# Initialize the RAG pipeline\n",
    "rag = GraphRAG(retriever=retriever, llm=llm)\n",
    "\n",
    "# Query the graph\n",
    "response = rag.search(query_text, retriever_config={\"top_k\": 3}, return_context=True)\n",
    "print(\"Response with GraphRAG:\")\n",
    "print(response.answer)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "7a673be6-fda6-463b-9edc-53b100501014",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": 42,
   "id": "d651b262-7bbe-4a2d-b2e8-c95be21f3d77",
   "metadata": {},
   "outputs": [],
   "source": [
    "import re\n",
    "# Define the regex pattern to match key-value pairs\n",
    "pattern = re.compile(r\"(\\w+\\.\\w+|type\\(r2\\)|\\w+)=('[^']*'|\\d+\\.\\d+|\\d+|[^' \\n]+)\")\n",
    "\n",
    "\n",
    "used_context = [item.content for item in response.retriever_result.items]\n",
    "used_context = [re.findall( pattern, item) for item in used_context]\n",
    "used_context = [{key: value.replace(\"'\",\"\") for key, value in matches} for matches in used_context]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 43,
   "id": "17b95779-b066-4ac4-b040-734975064e46",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[{'group': '00010004',\n",
       "  'chunkindex': '6',\n",
       "  'sourcelabel': 'Option',\n",
       "  'source': 'Verkehrssicherungsmaßnahmen',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Option',\n",
       "  'dest': 'LED-Anzeigetafel',\n",
       "  'score': '0.6960674524307251'},\n",
       " {'group': '00010004',\n",
       "  'chunkindex': '6',\n",
       "  'sourcelabel': 'Option',\n",
       "  'source': 'Verkehrssicherungsmaßnahmen',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Option',\n",
       "  'dest': 'Markierung',\n",
       "  'score': '0.6960674524307251'},\n",
       " {'group': '00010004',\n",
       "  'chunkindex': '6',\n",
       "  'sourcelabel': 'Option',\n",
       "  'source': 'Verkehrssicherungsmaßnahmen',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Option',\n",
       "  'dest': 'Lichtsignalanlage',\n",
       "  'score': '0.6960674524307251'},\n",
       " {'group': '00010004',\n",
       "  'chunkindex': '6',\n",
       "  'sourcelabel': 'Option',\n",
       "  'source': 'Verkehrssicherungsmaßnahmen',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Option',\n",
       "  'dest': 'Leitelement',\n",
       "  'score': '0.6960674524307251'},\n",
       " {'group': '00010004',\n",
       "  'chunkindex': '6',\n",
       "  'sourcelabel': 'Option',\n",
       "  'source': 'Verkehrssicherungsmaßnahmen',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Option',\n",
       "  'dest': 'Stauwarnanlage',\n",
       "  'score': '0.6960674524307251'},\n",
       " {'group': '00010004',\n",
       "  'chunkindex': '6',\n",
       "  'sourcelabel': 'Option',\n",
       "  'source': 'Verkehrssicherungsmaßnahmen',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Option',\n",
       "  'dest': 'Schutzeinrichtung',\n",
       "  'score': '0.6960674524307251'},\n",
       " {'group': '00010004',\n",
       "  'chunkindex': '6',\n",
       "  'sourcelabel': 'Option',\n",
       "  'source': 'Verkehrssicherungsmaßnahmen',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Norm',\n",
       "  'dest': 'OZ 00.01.0005',\n",
       "  'score': '0.6960674524307251'},\n",
       " {'group': '00010004',\n",
       "  'chunkindex': '6',\n",
       "  'sourcelabel': 'Option',\n",
       "  'source': 'Verkehrssicherungsmaßnahmen',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Norm',\n",
       "  'dest': 'OZ 00.01.0004',\n",
       "  'score': '0.6960674524307251'},\n",
       " {'group': '00010004',\n",
       "  'chunkindex': '6',\n",
       "  'sourcelabel': 'Option',\n",
       "  'source': 'Verkehrssicherungsmaßnahmen',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Dimension',\n",
       "  'dest': 'BA 1',\n",
       "  'score': '0.6960674524307251'},\n",
       " {'group': '00010004',\n",
       "  'chunkindex': '6',\n",
       "  'sourcelabel': 'Option',\n",
       "  'source': 'Verkehrssicherungsmaßnahmen',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Norm',\n",
       "  'dest': 'Verkehrsklasse P 5',\n",
       "  'score': '0.6960674524307251'},\n",
       " {'group': '00010004',\n",
       "  'chunkindex': '6',\n",
       "  'sourcelabel': 'Option',\n",
       "  'source': 'Verkehrssicherungsmaßnahmen',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Amount',\n",
       "  'dest': '70.0',\n",
       "  'score': '0.6960674524307251'},\n",
       " {'group': '00010004',\n",
       "  'chunkindex': '6',\n",
       "  'sourcelabel': 'Option',\n",
       "  'source': 'Längsmarkierung Typ II',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Norm',\n",
       "  'dest': 'Verkehrsklasse P 5',\n",
       "  'score': '0.6960674524307251'},\n",
       " {'group': '00010004',\n",
       "  'chunkindex': '6',\n",
       "  'sourcelabel': 'Option',\n",
       "  'source': 'Sperrflä',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Norm',\n",
       "  'dest': 'Verkehrsklasse P 5',\n",
       "  'score': '0.6960674524307251'},\n",
       " {'group': '00010004',\n",
       "  'chunkindex': '6',\n",
       "  'sourcelabel': 'Option',\n",
       "  'source': 'Vormarkieren',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Norm',\n",
       "  'dest': 'Verkehrsklasse P 5',\n",
       "  'score': '0.6960674524307251'},\n",
       " {'group': '00010004',\n",
       "  'chunkindex': '6',\n",
       "  'sourcelabel': 'Option',\n",
       "  'source': 'Fahrbahnbegrenzung',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Norm',\n",
       "  'dest': 'Verkehrsklasse P 5',\n",
       "  'score': '0.6960674524307251'},\n",
       " {'group': '00010004',\n",
       "  'chunkindex': '6',\n",
       "  'sourcelabel': 'Dimension',\n",
       "  'source': 'Strichbreite',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Amount',\n",
       "  'dest': '0.15 m',\n",
       "  'score': '0.6960674524307251'},\n",
       " {'group': '00010004',\n",
       "  'chunkindex': '6',\n",
       "  'sourcelabel': 'Unit',\n",
       "  'source': 'm',\n",
       "  'reltype': 'None',\n",
       "  'destlabel': 'None',\n",
       "  'dest': 'None',\n",
       "  'score': '0.6960674524307251'},\n",
       " {'group': '00010004',\n",
       "  'chunkindex': '6',\n",
       "  'sourcelabel': 'Amount',\n",
       "  'source': 'None',\n",
       "  'reltype': 'None',\n",
       "  'destlabel': 'None',\n",
       "  'dest': 'None',\n",
       "  'score': '0.6960674524307251'},\n",
       " {'group': '00010004',\n",
       "  'chunkindex': '6',\n",
       "  'sourcelabel': 'Material',\n",
       "  'source': 'Folie',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Option',\n",
       "  'dest': 'G Käger',\n",
       "  'score': '0.6960674524307251'},\n",
       " {'group': '00010004',\n",
       "  'chunkindex': '6',\n",
       "  'sourcelabel': 'Option',\n",
       "  'source': 'G Käger',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Material',\n",
       "  'dest': 'Folie',\n",
       "  'score': '0.6960674524307251'},\n",
       " {'group': '00010004',\n",
       "  'chunkindex': '6',\n",
       "  'sourcelabel': 'Norm',\n",
       "  'source': 'Verkehrsklasse P 5',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Option',\n",
       "  'dest': 'Verkehrssicherungsmaßnahmen',\n",
       "  'score': '0.6960674524307251'},\n",
       " {'group': '00010004',\n",
       "  'chunkindex': '6',\n",
       "  'sourcelabel': 'Norm',\n",
       "  'source': 'Verkehrsklasse P 5',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Option',\n",
       "  'dest': 'Längsmarkierung Typ II',\n",
       "  'score': '0.6960674524307251'},\n",
       " {'group': '00010004',\n",
       "  'chunkindex': '6',\n",
       "  'sourcelabel': 'Norm',\n",
       "  'source': 'Verkehrsklasse P 5',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Option',\n",
       "  'dest': 'Sperrflä',\n",
       "  'score': '0.6960674524307251'},\n",
       " {'group': '00010004',\n",
       "  'chunkindex': '6',\n",
       "  'sourcelabel': 'Norm',\n",
       "  'source': 'Verkehrsklasse P 5',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Option',\n",
       "  'dest': 'Vormarkieren',\n",
       "  'score': '0.6960674524307251'},\n",
       " {'group': '00010004',\n",
       "  'chunkindex': '6',\n",
       "  'sourcelabel': 'Norm',\n",
       "  'source': 'Verkehrsklasse P 5',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Option',\n",
       "  'dest': 'Fahrbahnbegrenzung',\n",
       "  'score': '0.6960674524307251'},\n",
       " {'group': '00010004',\n",
       "  'chunkindex': '6',\n",
       "  'sourcelabel': 'Norm',\n",
       "  'source': 'Verkehrsklasse P 5',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Option',\n",
       "  'dest': 'Markierung entfernen',\n",
       "  'score': '0.6960674524307251'},\n",
       " {'group': '00010004',\n",
       "  'chunkindex': '6',\n",
       "  'sourcelabel': 'Norm',\n",
       "  'source': 'Verkehrsklasse P 5',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Option',\n",
       "  'dest': 'Abfall aufnehmen',\n",
       "  'score': '0.6960674524307251'},\n",
       " {'group': '00010004',\n",
       "  'chunkindex': '6',\n",
       "  'sourcelabel': 'Norm',\n",
       "  'source': 'Verkehrsklasse P 5',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Option',\n",
       "  'dest': 'verwerten',\n",
       "  'score': '0.6960674524307251'},\n",
       " {'group': '00010004',\n",
       "  'chunkindex': '6',\n",
       "  'sourcelabel': 'Option',\n",
       "  'source': 'Markierung entfernen',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Norm',\n",
       "  'dest': 'Verkehrsklasse P 5',\n",
       "  'score': '0.6960674524307251'},\n",
       " {'group': '00010004',\n",
       "  'chunkindex': '6',\n",
       "  'sourcelabel': 'Option',\n",
       "  'source': 'Abfall aufnehmen',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Norm',\n",
       "  'dest': 'Verkehrsklasse P 5',\n",
       "  'score': '0.6960674524307251'},\n",
       " {'group': '00010004',\n",
       "  'chunkindex': '6',\n",
       "  'sourcelabel': 'Option',\n",
       "  'source': 'verwerten',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Norm',\n",
       "  'dest': 'Verkehrsklasse P 5',\n",
       "  'score': '0.6960674524307251'},\n",
       " {'group': '00010005',\n",
       "  'chunkindex': '7',\n",
       "  'sourcelabel': 'Option',\n",
       "  'source': 'Verkehrssicherungsmaßnahmen',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Option',\n",
       "  'dest': 'LED-Anzeigetafel',\n",
       "  'score': '0.6890568733215332'},\n",
       " {'group': '00010005',\n",
       "  'chunkindex': '7',\n",
       "  'sourcelabel': 'Option',\n",
       "  'source': 'Verkehrssicherungsmaßnahmen',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Option',\n",
       "  'dest': 'Markierung',\n",
       "  'score': '0.6890568733215332'},\n",
       " {'group': '00010005',\n",
       "  'chunkindex': '7',\n",
       "  'sourcelabel': 'Option',\n",
       "  'source': 'Verkehrssicherungsmaßnahmen',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Option',\n",
       "  'dest': 'Lichtsignalanlage',\n",
       "  'score': '0.6890568733215332'},\n",
       " {'group': '00010005',\n",
       "  'chunkindex': '7',\n",
       "  'sourcelabel': 'Option',\n",
       "  'source': 'Verkehrssicherungsmaßnahmen',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Option',\n",
       "  'dest': 'Leitelement',\n",
       "  'score': '0.6890568733215332'},\n",
       " {'group': '00010005',\n",
       "  'chunkindex': '7',\n",
       "  'sourcelabel': 'Option',\n",
       "  'source': 'Verkehrssicherungsmaßnahmen',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Option',\n",
       "  'dest': 'Stauwarnanlage',\n",
       "  'score': '0.6890568733215332'},\n",
       " {'group': '00010005',\n",
       "  'chunkindex': '7',\n",
       "  'sourcelabel': 'Option',\n",
       "  'source': 'Verkehrssicherungsmaßnahmen',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Option',\n",
       "  'dest': 'Schutzeinrichtung',\n",
       "  'score': '0.6890568733215332'},\n",
       " {'group': '00010005',\n",
       "  'chunkindex': '7',\n",
       "  'sourcelabel': 'Option',\n",
       "  'source': 'Verkehrssicherungsmaßnahmen',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Norm',\n",
       "  'dest': 'OZ 00.01.0005',\n",
       "  'score': '0.6890568733215332'},\n",
       " {'group': '00010005',\n",
       "  'chunkindex': '7',\n",
       "  'sourcelabel': 'Option',\n",
       "  'source': 'Verkehrssicherungsmaßnahmen',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Norm',\n",
       "  'dest': 'OZ 00.01.0004',\n",
       "  'score': '0.6890568733215332'},\n",
       " {'group': '00010005',\n",
       "  'chunkindex': '7',\n",
       "  'sourcelabel': 'Option',\n",
       "  'source': 'Verkehrssicherungsmaßnahmen',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Dimension',\n",
       "  'dest': 'BA 1',\n",
       "  'score': '0.6890568733215332'},\n",
       " {'group': '00010005',\n",
       "  'chunkindex': '7',\n",
       "  'sourcelabel': 'Option',\n",
       "  'source': 'Verkehrssicherungsmaßnahmen',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Norm',\n",
       "  'dest': 'Verkehrsklasse P 5',\n",
       "  'score': '0.6890568733215332'},\n",
       " {'group': '00010005',\n",
       "  'chunkindex': '7',\n",
       "  'sourcelabel': 'Option',\n",
       "  'source': 'Verkehrssicherungsmaßnahmen',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Amount',\n",
       "  'dest': '70.0',\n",
       "  'score': '0.6890568733215332'},\n",
       " {'group': '00010005',\n",
       "  'chunkindex': '7',\n",
       "  'sourcelabel': 'Option',\n",
       "  'source': 'Markierung',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Option',\n",
       "  'dest': 'Verkehrssicherungsmaßnahmen',\n",
       "  'score': '0.6890568733215332'},\n",
       " {'group': '00010005',\n",
       "  'chunkindex': '7',\n",
       "  'sourcelabel': 'Option',\n",
       "  'source': 'Pfeil',\n",
       "  'reltype': 'None',\n",
       "  'destlabel': 'None',\n",
       "  'dest': 'None',\n",
       "  'score': '0.6890568733215332'},\n",
       " {'group': '00010005',\n",
       "  'chunkindex': '7',\n",
       "  'sourcelabel': 'Option',\n",
       "  'source': 'Buchstabe',\n",
       "  'reltype': 'None',\n",
       "  'destlabel': 'None',\n",
       "  'dest': 'None',\n",
       "  'score': '0.6890568733215332'},\n",
       " {'group': '00010005',\n",
       "  'chunkindex': '7',\n",
       "  'sourcelabel': 'Option',\n",
       "  'source': 'Ziffer',\n",
       "  'reltype': 'None',\n",
       "  'destlabel': 'None',\n",
       "  'dest': 'None',\n",
       "  'score': '0.6890568733215332'},\n",
       " {'group': '00010005',\n",
       "  'chunkindex': '7',\n",
       "  'sourcelabel': 'Option',\n",
       "  'source': 'Verkehrsschild',\n",
       "  'reltype': 'None',\n",
       "  'destlabel': 'None',\n",
       "  'dest': 'None',\n",
       "  'score': '0.6890568733215332'},\n",
       " {'group': '00010005',\n",
       "  'chunkindex': '7',\n",
       "  'sourcelabel': 'Option',\n",
       "  'source': 'Piktogramm',\n",
       "  'reltype': 'None',\n",
       "  'destlabel': 'None',\n",
       "  'dest': 'None',\n",
       "  'score': '0.6890568733215332'},\n",
       " {'group': '00010005',\n",
       "  'chunkindex': '7',\n",
       "  'sourcelabel': 'Norm',\n",
       "  'source': 'OZ_00_01_0007',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Option',\n",
       "  'dest': 'BA_1',\n",
       "  'score': '0.6890568733215332'},\n",
       " {'group': '00010005',\n",
       "  'chunkindex': '7',\n",
       "  'sourcelabel': 'Option',\n",
       "  'source': 'BA_1',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Norm',\n",
       "  'dest': 'OZ_00_01_0007',\n",
       "  'score': '0.6890568733215332'},\n",
       " {'group': '00010005',\n",
       "  'chunkindex': '7',\n",
       "  'sourcelabel': 'Unit',\n",
       "  'source': 'Kalendertag',\n",
       "  'reltype': 'None',\n",
       "  'destlabel': 'None',\n",
       "  'dest': 'None',\n",
       "  'score': '0.6890568733215332'},\n",
       " {'group': '00010007',\n",
       "  'chunkindex': '9',\n",
       "  'sourcelabel': 'Norm',\n",
       "  'source': 'ZTV-SA',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Option',\n",
       "  'dest': 'Verkehrsführungspläne',\n",
       "  'score': '0.6399451494216919'},\n",
       " {'group': '00010007',\n",
       "  'chunkindex': '9',\n",
       "  'sourcelabel': 'Norm',\n",
       "  'source': 'ZTV-SA',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Option',\n",
       "  'dest': 'Regelpläne',\n",
       "  'score': '0.6399451494216919'},\n",
       " {'group': '00010007',\n",
       "  'chunkindex': '9',\n",
       "  'sourcelabel': 'Norm',\n",
       "  'source': 'ZTV-SA',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Option',\n",
       "  'dest': 'Verkehrssicherung',\n",
       "  'score': '0.6399451494216919'},\n",
       " {'group': '00010007',\n",
       "  'chunkindex': '9',\n",
       "  'sourcelabel': 'Norm',\n",
       "  'source': 'ZTV-SA',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Option',\n",
       "  'dest': 'Arbeitsstellen',\n",
       "  'score': '0.6399451494216919'},\n",
       " {'group': '00010007',\n",
       "  'chunkindex': '9',\n",
       "  'sourcelabel': 'Norm',\n",
       "  'source': 'ZTV-SA',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Option',\n",
       "  'dest': 'Temporäre Verkehrsschilder',\n",
       "  'score': '0.6399451494216919'},\n",
       " {'group': '00010007',\n",
       "  'chunkindex': '9',\n",
       "  'sourcelabel': 'Norm',\n",
       "  'source': 'ZTV-SA',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Option',\n",
       "  'dest': 'Vorübergehende Markierungen',\n",
       "  'score': '0.6399451494216919'},\n",
       " {'group': '00010007',\n",
       "  'chunkindex': '9',\n",
       "  'sourcelabel': 'Norm',\n",
       "  'source': 'ZTV-SA',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Option',\n",
       "  'dest': 'Transportable Leitelemente',\n",
       "  'score': '0.6399451494216919'},\n",
       " {'group': '00010007',\n",
       "  'chunkindex': '9',\n",
       "  'sourcelabel': 'Norm',\n",
       "  'source': 'ZTV-SA',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Option',\n",
       "  'dest': 'Transportable Schutzeinrichtungen',\n",
       "  'score': '0.6399451494216919'},\n",
       " {'group': '00010007',\n",
       "  'chunkindex': '9',\n",
       "  'sourcelabel': 'Norm',\n",
       "  'source': 'ZTV-SA',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Option',\n",
       "  'dest': 'temporäre_Verkehrsschilder',\n",
       "  'score': '0.6399451494216919'},\n",
       " {'group': '00010007',\n",
       "  'chunkindex': '9',\n",
       "  'sourcelabel': 'Norm',\n",
       "  'source': 'ZTV-SA',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Option',\n",
       "  'dest': 'Markierungen',\n",
       "  'score': '0.6399451494216919'},\n",
       " {'group': '00010007',\n",
       "  'chunkindex': '9',\n",
       "  'sourcelabel': 'Norm',\n",
       "  'source': 'ZTV-SA',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Option',\n",
       "  'dest': 'transportable_Lichtsignalanlagen',\n",
       "  'score': '0.6399451494216919'},\n",
       " {'group': '00010007',\n",
       "  'chunkindex': '9',\n",
       "  'sourcelabel': 'Norm',\n",
       "  'source': 'ZTV-SA',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Option',\n",
       "  'dest': 'bauliche_Leitelemente',\n",
       "  'score': '0.6399451494216919'},\n",
       " {'group': '00010007',\n",
       "  'chunkindex': '9',\n",
       "  'sourcelabel': 'Norm',\n",
       "  'source': 'ZTV-SA',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Option',\n",
       "  'dest': 'transportable_S',\n",
       "  'score': '0.6399451494216919'},\n",
       " {'group': '00010007',\n",
       "  'chunkindex': '9',\n",
       "  'sourcelabel': 'Option',\n",
       "  'source': 'temporäre_Verkehrsschilder',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Norm',\n",
       "  'dest': 'ZTV-SA',\n",
       "  'score': '0.6399451494216919'},\n",
       " {'group': '00010007',\n",
       "  'chunkindex': '9',\n",
       "  'sourcelabel': 'Option',\n",
       "  'source': 'Markierungen',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Norm',\n",
       "  'dest': 'ZTV-SA',\n",
       "  'score': '0.6399451494216919'},\n",
       " {'group': '00010007',\n",
       "  'chunkindex': '9',\n",
       "  'sourcelabel': 'Option',\n",
       "  'source': 'transportable_Lichtsignalanlagen',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Norm',\n",
       "  'dest': 'ZTV-SA',\n",
       "  'score': '0.6399451494216919'},\n",
       " {'group': '00010007',\n",
       "  'chunkindex': '9',\n",
       "  'sourcelabel': 'Option',\n",
       "  'source': 'bauliche_Leitelemente',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Norm',\n",
       "  'dest': 'ZTV-SA',\n",
       "  'score': '0.6399451494216919'},\n",
       " {'group': '00010007',\n",
       "  'chunkindex': '9',\n",
       "  'sourcelabel': 'Option',\n",
       "  'source': 'transportable_S',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Norm',\n",
       "  'dest': 'ZTV-SA',\n",
       "  'score': '0.6399451494216919'},\n",
       " {'group': '00010007',\n",
       "  'chunkindex': '9',\n",
       "  'sourcelabel': 'Norm',\n",
       "  'source': 'StVO',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Option',\n",
       "  'dest': 'Zeichen_101',\n",
       "  'score': '0.6399451494216919'},\n",
       " {'group': '00010007',\n",
       "  'chunkindex': '9',\n",
       "  'sourcelabel': 'Norm',\n",
       "  'source': 'StVO',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Option',\n",
       "  'dest': 'Zeichen_274-80',\n",
       "  'score': '0.6399451494216919'},\n",
       " {'group': '00010007',\n",
       "  'chunkindex': '9',\n",
       "  'sourcelabel': 'Norm',\n",
       "  'source': 'StVO',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Option',\n",
       "  'dest': 'Zusatzzeichen_1007-52',\n",
       "  'score': '0.6399451494216919'},\n",
       " {'group': '00010007',\n",
       "  'chunkindex': '9',\n",
       "  'sourcelabel': 'Option',\n",
       "  'source': 'Zeichen_101',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Norm',\n",
       "  'dest': 'StVO',\n",
       "  'score': '0.6399451494216919'},\n",
       " {'group': '00010007',\n",
       "  'chunkindex': '9',\n",
       "  'sourcelabel': 'Option',\n",
       "  'source': 'Zeichen_274-80',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Norm',\n",
       "  'dest': 'StVO',\n",
       "  'score': '0.6399451494216919'},\n",
       " {'group': '00010007',\n",
       "  'chunkindex': '9',\n",
       "  'sourcelabel': 'Option',\n",
       "  'source': 'Zusatzzeichen_1007-52',\n",
       "  'reltype': 'HAS_OPTION',\n",
       "  'destlabel': 'Norm',\n",
       "  'dest': 'StVO',\n",
       "  'score': '0.6399451494216919'},\n",
       " {'group': '00010007',\n",
       "  'chunkindex': '9',\n",
       "  'sourcelabel': 'Relation',\n",
       "  'source': 'None',\n",
       "  'reltype': 'None',\n",
       "  'destlabel': 'None',\n",
       "  'dest': 'None',\n",
       "  'score': '0.6399451494216919'}]"
      ]
     },
     "execution_count": 43,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "used_context"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 44,
   "id": "b8e770c4-e959-45a2-a0eb-e40b04c426d5",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "application/vnd.jupyter.widget-view+json": {
       "model_id": "bec9749557a9475386cf3fb00dca2898",
       "version_major": 2,
       "version_minor": 0
      },
      "text/plain": [
       "GraphWidget(layout=Layout(height='800px', width='100%'))"
      ]
     },
     "metadata": {},
     "output_type": "display_data"
    }
   ],
   "source": [
    "# Visualize the graph in Neo4j\n",
    "from yfiles_jupyter_graphs_for_neo4j import Neo4jGraphWidget\n",
    "widget = Neo4jGraphWidget(driver, overview_enabled=False, context_start_with=None)\n",
    "widget.show_cypher(\"\"\"\n",
    "UNWIND $context as row\n",
    "MATCH (c:Chunk)<-[r1]-(n)-[r2]-(m) \n",
    "WHERE c.index = toInteger(row['chunkindex']) AND type(r2) <> \"IN\"\n",
    "RETURN c, r1, n, r2, m LIMIT 500\n",
    "\"\"\", context=used_context)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "0c551218-eae6-48de-a289-7ee0448c9689",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "7780b22b-d502-4aaf-a532-c8b3dd673439",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "18a6a0b6-cd5a-4f48-a01c-48cf42c150a2",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "65276dd5-bd7c-4577-ac29-94bd495e8e73",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "c13ee5ad-b875-4365-b88c-e31de804ad8a",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "fb7c8caf-c6ce-463e-b345-41e7f01d2021",
   "metadata": {},
   "outputs": [],
   "source": []
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "1d09fa53-97f6-400c-b7bd-361d5544bba3",
   "metadata": {},
   "outputs": [],
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3 (ipykernel)",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.9.15"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
